EDT/УТ/src/InformationRegisters/ШтрихкодыЗаказов/ШтрихкодыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыЗаказов</name>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТСД</name>
    <type>
      <types>DocumentRef.ЗагрузкаСТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКПереданПартнером</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ШтрихкодыЗаказов/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	// избавимся от дублей и ошибок с ними связанных
	НаборТЗ = ЭтотОбъект.Выгрузить();	
	НаборТЗ.Свернуть("Заказ, Штрихкод, НомерМеста, ДокументТСД, ШКПереданПартнером");	
	ЭтотОбъект.Загрузить(НаборТЗ);
		
КонецПроцедуры
